Revit 2026 API

# BuiltInFailuresDecalFailures Class

---

Failures about Decal.

SystemObject Autodesk.Revit.DBBuiltInFailuresDecalFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DecalFailures
```
```vb
Public NotInheritable Class DecalFailures
```
```cpp
public ref class DecalFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DecalFailures = class end
```

The BuiltInFailuresDecalFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotPaste | Can't place Decal at new position. |
|  | LongerThanPossible | Decal element is longer than the circumference of the surface. |
|  | OutsideHost | Decal does not lie on host. |

#### Reference

Autodesk.Revit.DB Namespace